/**********************************************************
* @ File name -> config.h
* @ Version   -> V1.0
* @ Date      -> 11-04-2013
* @ Brief     -> 系统定义头文件
* @           -> 增加或者减少相关的头文件可以在此头文件操作
**********************************************************/

#ifndef		_STM32_config_h_
#define		_STM32_config_h_

/**********************************************************
                     外部函数头文件
         应用到不同的外设头文件请在这里修改即可                        
**********************************************************/

#include "sys.h"
#include "stm32f10x.h"

#include "string.h"	//内存操作相关函数库
#include "math.h"	//数学运算相关函数库

#include "delay.h"
#include "usart.h"




#endif

